BEGIN;

-- очистим таблицы и сбросим счетчики
TRUNCATE TABLE bike_prices, bikes, categories, seasons, users RESTART IDENTITY CASCADE;

-- =========================
-- categories
-- =========================
COPY public.categories (id, name, description) FROM stdin;
1	Light Scooters	110cc–125cc
2	Comfort Scooters	150cc–160cc
3	Maxy Scooters	300cc–350cc
\.

-- =========================
-- bikes
-- =========================
COPY public.bikes (id, bike_id, name, category_id, description, meta) FROM stdin;
1	click-blue-125-2019-A	Click 125cc, Blue, 2019	1	Лёгкий скутер, отлично подходит для поездок по острову.	\N
2	aerox-green-155-2018-A	Aerox 155cc, ABS, Green, 2018	2	Комфортный скутер для двух человек, ABS, экономичный.	\N
3	pcx-silver-150-2018-A	PCX 150cc, Silver, 2018	2	Комфортный скутер для двух человек, ABS, экономичный.	\N
4	pcx-blue-150-2019-A	PCX 150cc, Blue, 2019	2	Комфортный скутер для двух человек, ABS, экономичный.	\N
5	pcx-black-150-2018-A	PCX 150cc, Black, 2018	2	Комфортный скутер для двух человек, ABS, экономичный.	\N
6	adv-black-160-2023-A	ADV 160cc, ABS, Black, 2022	2	ADV-модель с высоким клиренсом и мощным двигателем.	\N
7	nmax-blue-155-2022-A	N-Max 155cc, ABS, Blue, 2022	2	Удобный городской скутер с ABS, подходит для всех дорог.	\N
8	nmax-black-155-2022-A	N-Max 155cc, ABS, Black, 2022	2	Удобный городской скутер с ABS, подходит для всех дорог.	\N
9	pcx-black-160-2022-A	PCX 160cc, ABS, Black, 2022	2	Новая версия PCX с улучшенным двигателем и дизайном.	\N
10	pcx-white-160-2022-A	PCX 160cc, White, 2022	2	Новая версия PCX с улучшенным двигателем и дизайном.	\N
11	pcx-black-160-2023-A	PCX 160cc, ABS, Black, 2023	2	Новая версия PCX с улучшенным двигателем и дизайном.	\N
12	pcx-blue-160-2023-A	PCX 160cc, ABS, Blue, 2023	2	Новая версия PCX с улучшенным двигателем и дизайном.	\N
13	adv-red-160-2024-A	ADV 160cc, ABS, Red, 2024	2	ADV-модель с высоким клиренсом и мощным двигателем.	\N
14	forza-black-350-2023-A	Forza 350cc, ABS, Black, 2023	3	Максимальный комфорт и мощность. Идеален для длительных поездок.	\N
15	xmax-black-300-2024-A	Xmax 300cc, ABS, Black, 2024	3	Максимальный комфорт и мощность. Идеален для длительных поездок.	\N
16	adv-black-350-2025-A	ADV 350cc, ABS, Black, 2025	3	ADV-серия с максимальной мощностью и проходимостью.	\N
\.

-- =========================
-- seasons
-- =========================
COPY public.seasons (id, name, months) FROM stdin;
1	Low	{6,7,8,9}
2	Middle	{4,5,10,11}
3	High	{12,1,2,3}
\.

-- =========================
-- bike_prices
-- =========================
COPY public.bike_prices (id, bike_id, season_id, days_type, price_per_day) FROM stdin;
1	1	3	1d	250
2	1	3	7d	243
3	1	3	14d	214
4	1	3	21d	190
5	1	3	month	150
6	1	2	1d	250
7	1	2	7d	200
8	1	2	14d	186
9	1	2	21d	162
10	1	2	month	130
11	1	1	1d	200
12	1	1	7d	171
13	1	1	14d	161
14	1	1	21d	142
15	1	1	month	117
16	2	3	1d	300
17	2	3	7d	271
18	2	3	14d	236
19	2	3	21d	210
20	2	3	month	173
21	2	2	1d	250
22	2	2	7d	229
23	2	2	14d	214
24	2	2	21d	200
25	2	2	month	160
26	2	1	1d	250
27	2	1	7d	186
28	2	1	14d	171
29	2	1	21d	167
30	2	1	month	133
31	3	3	1d	330
32	3	3	7d	300
33	3	3	14d	271
34	3	3	21d	240
35	3	3	month	200
36	3	2	1d	300
37	3	2	7d	250
38	3	2	14d	200
39	3	2	21d	219
40	3	2	month	175
41	3	1	1d	250
42	3	1	7d	200
43	3	1	14d	179
44	3	1	21d	185
45	3	1	month	150
46	4	3	1d	330
47	4	3	7d	300
48	4	3	14d	271
49	4	3	21d	240
50	4	3	month	200
51	4	2	1d	300
52	4	2	7d	250
53	4	2	14d	200
54	4	2	21d	219
55	4	2	month	175
56	4	1	1d	250
57	4	1	7d	200
58	4	1	14d	179
59	4	1	21d	185
60	4	1	month	150
61	5	3	1d	330
62	5	3	7d	300
63	5	3	14d	271
64	5	3	21d	240
65	5	3	month	200
66	5	2	1d	300
67	5	2	7d	250
68	5	2	14d	200
69	5	2	21d	219
70	5	2	month	175
71	5	1	1d	250
72	5	1	7d	200
73	5	1	14d	179
74	5	1	21d	185
75	5	1	month	150
76	7	3	1d	350
77	7	3	7d	314
78	7	3	14d	300
79	7	3	21d	300
80	7	3	month	233
81	7	2	1d	330
82	7	2	7d	286
83	7	2	14d	264
84	7	2	21d	242
85	7	2	month	200
86	7	1	1d	300
87	7	1	7d	257
88	7	1	14d	236
89	7	1	21d	228
90	7	1	month	183
91	8	3	1d	350
92	8	3	7d	314
93	8	3	14d	300
94	8	3	21d	300
95	8	3	month	233
96	8	2	1d	330
97	8	2	7d	286
98	8	2	14d	264
99	8	2	21d	247
100	8	2	month	200
101	8	1	1d	300
102	8	1	7d	257
103	8	1	14d	236
104	8	1	21d	228
105	8	1	month	183
106	10	3	1d	350
107	10	3	7d	314
108	10	3	14d	300
109	10	3	21d	300
110	10	3	month	233
111	10	2	1d	330
112	10	2	7d	286
113	10	2	14d	264
114	10	2	21d	247
115	10	2	month	200
116	10	1	1d	300
117	10	1	7d	257
118	10	1	14d	236
119	10	1	21d	228
120	10	1	month	183
121	9	3	1d	350
122	9	3	7d	314
123	9	3	14d	300
124	9	3	21d	300
125	9	3	month	233
126	9	2	1d	330
127	9	2	7d	286
128	9	2	14d	264
129	9	2	21d	247
130	9	2	month	200
131	9	1	1d	300
132	9	1	7d	257
133	9	1	14d	236
134	9	1	21d	228
135	9	1	month	183
136	11	3	1d	370
137	11	3	7d	343
138	11	3	14d	314
139	11	3	21d	320
140	11	3	month	250
141	11	2	1d	350
142	11	2	7d	314
143	11	2	14d	300
144	11	2	21d	247
145	11	2	month	217
146	11	1	1d	330
147	11	1	7d	286
148	11	1	14d	257
149	11	1	21d	233
150	11	1	month	190
151	12	3	1d	400
152	12	3	7d	357
153	12	3	14d	350
154	12	3	21d	333
155	12	3	month	263
156	12	2	1d	370
157	12	2	7d	343
158	12	2	14d	321
159	12	2	21d	285
160	12	2	month	230
161	12	1	1d	330
162	12	1	7d	314
163	12	1	14d	271
164	12	1	21d	262
165	12	1	month	210
166	13	3	1d	450
167	13	3	7d	400
168	13	3	14d	350
169	13	3	21d	333
170	13	3	month	267
171	13	2	1d	370
172	13	2	7d	357
173	13	2	14d	343
174	13	2	21d	290
175	13	2	month	233
176	13	1	1d	350
177	13	1	7d	343
178	13	1	14d	286
179	13	1	21d	267
180	13	1	month	216
181	14	3	1d	850
182	14	3	7d	786
183	14	3	14d	714
184	14	3	21d	690
185	14	3	month	550
186	14	2	1d	750
187	14	2	7d	750
188	14	2	14d	643
189	14	2	21d	619
190	14	2	month	500
191	14	1	1d	700
192	14	1	7d	700
193	14	1	14d	571
194	14	1	21d	547
195	14	1	month	450
196	15	3	1d	900
197	15	3	7d	857
198	15	3	14d	800
199	15	3	21d	738
200	15	3	month	600
201	15	2	1d	800
202	15	2	7d	800
203	15	2	14d	714
204	15	2	21d	685
205	15	2	month	550
206	15	1	1d	750
207	15	1	7d	714
208	15	1	14d	643
209	15	1	21d	571
210	15	1	month	467
211	16	3	1d	1000
212	16	3	7d	943
213	16	3	14d	900
214	16	3	21d	809
215	16	3	month	650
216	16	2	1d	900
217	16	2	7d	900
218	16	2	14d	850
219	16	2	21d	742
220	16	2	month	600
221	16	1	1d	800
222	16	1	7d	857
223	16	1	14d	714
224	16	1	21d	685
225	16	1	month	550
\.

-- =========================
-- users
-- =========================
COPY public.users (id, telegram_id, telegram_name, name, phone, passport_photo_file_id, is_admin, meta, created_at, lang) FROM stdin;
23	1948997922	danykrasniy	Даниил	+79515328255	1948997922_passport.jpg	f	{}	2025-07-12 19:02:43.412651+03	ru
27	336811895	oleksiipol	Oleksii	+380637660508	336811895_passport.jpg	f	{}	2025-07-17 14:29:15.484055+03	ru
37	385700028	drivephangan	\N	\N	\N	t	{}	2025-07-21 15:18:58.809254+03	ru
\.

-- выставим корректные значения последовательностей
SELECT pg_catalog.setval('public.categories_id_seq', 3, true);
SELECT pg_catalog.setval('public.bikes_id_seq', 16, true);
SELECT pg_catalog.setval('public.seasons_id_seq', 3, true);
SELECT pg_catalog.setval('public.bike_prices_id_seq', 225, true);
SELECT pg_catalog.setval('public.users_id_seq', 37, true);

COMMIT;
